&НаКлиенте
Процедура ОбработкаНажатияКнопки(Команда)
	// Вызов серверной логики
	ОбработатьСписокНоменклатуры(ВведеннаяСтрока);
КонецПроцедуры

&НаСервере 
Процедура ОбработатьСписокНоменклатуры(СтрокаДляОбработки) Экспорт
    Разделитель = "\";
    ПолученныеГруппы = СтрРазделить(СтрокаДляОбработки, Разделитель);
	
	СсылкаНаКорень = Справочники.Номенклатура.НайтиПоНаименованию(ПолученныеГруппы[0]);  
	
	//Проверка корня, если нет создаем новый
	Если СсылкаНаКорень.Пустая() Тогда 
		НовыйКорень = Справочники.Номенклатура.СоздатьГруппу();
		НовыйКорень.Наименование = ПолученныеГруппы[0];
		НовыйКорень.Записать();		
		СсылкаНаКорень = НовыйКорень;
	КонецЕсли;
	
	Счетчик = 1;  
	Родитель = СсылкаНаКорень.Ссылка;
	
	Пока ПолученныеГруппы.Количество() > 1 И ПолученныеГруппы.Количество() - 1 >= Счетчик Цикл
		Если ПолученныеГруппы.Количество() - 1 = Счетчик Тогда
			Если ПроверкаГруппы(Родитель, ПолученныеГруппы[Счетчик]) Тогда 
				Сообщить("Искомая группа - " + ПолученныеГруппы[Счетчик] + " существует!");
			Иначе
				Сообщить("Искомая группа - " + ПолученныеГруппы[Счетчик] + " была создана!");
			КонецЕсли;
		КонецЕсли;		
		Родитель = ОбработкаГруппы(Родитель, ПолученныеГруппы[Счетчик]);
		Счетчик = Счетчик + 1;		
	КонецЦикла;
	
КонецПроцедуры     

//Функция для проверки есть ли дочерняя группа в детях родителя 
Функция ПроверкаГруппы(Родитель, ДочерняяГруппа)
	ДочерниеГруппы = Справочники.Номенклатура.Выбрать(Родитель);
	
	Пока ДочерниеГруппы.Следующий() Цикл
		Если ДочерняяГруппа = ДочерниеГруппы.Наименование Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;   
	
	Возврат Ложь;
	
КонецФункции

//Функция для обработки вложенности групп в справочнике
Функция ОбработкаГруппы(Родитель, ДочерняяГруппа)
	ДочерниеГруппы = Справочники.Номенклатура.Выбрать(Родитель);
	
	Пока ДочерниеГруппы.Следующий() Цикл
		Если ДочерняяГруппа = ДочерниеГруппы.Наименование Тогда
			Возврат ДочерниеГруппы.Ссылка;
		КонецЕсли;
	КонецЦикла;   
	
	НоваяДочерняяГруппа = Справочники.Номенклатура.СоздатьГруппу();
	НоваяДочерняяГруппа.Родитель = Родитель;
	НоваяДочерняяГруппа.Наименование = ДочерняяГруппа;
	НоваяДочерняяГруппа.Записать();
	
	Возврат НоваяДочерняяГруппа.Ссылка;
	
КонецФункции;  